app/controllers/coordinate_controller.rb

    def find
      # find the nearest point from coordinate table
      @coordinate = Coordinate.near(coordinate_params["coordinate"].split(","), 5, units: :km).first
---
SELECT coordinates.*, 6371.0 * 2 * ASIN(SQRT(POWER(SIN((70.0 - coordinates.latitude) * PI() / 180 / 2), 2) + COS(70.0 * PI() / 180) * COS(coordinates.latitude * PI() / 180) * POWER(SIN((70.0 - coordinates.longitude) * PI() / 180 / 2), 2))) AS distance, MOD(CAST((ATAN2( ((coordinates.longitude - 70.0) / 57.2957795), ((coordinates.latitude - 70.0) / 57.2957795)) * 57.2957795) + 360 AS decimal), 360) AS bearing FROM "coordinates" WHERE (coordinates.latitude BETWEEN 69.99100678394082 AND 70.00899321605918 AND coordinates.longitude BETWEEN 69.97370559531453 AND 70.02629440468547 AND (6371.0 * 2 * ASIN(SQRT(POWER(SIN((70.0 - coordinates.latitude) * PI() / 180 / 2), 2) + COS(70.0 * PI() / 180) * COS(coordinates.latitude * PI() / 180) * POWER(SIN((70.0 - coordinates.longitude) * PI() / 180 / 2), 2)))) BETWEEN 0.0 AND 1) ORDER BY distance ASC LIMIT $1  [["LIMIT", 11]]

    def create
      @coordinate = Coordinate.new(coordinate_params)
      @coordinate.save
---
INSERT INTO "coordinates" ("latitude", "longitude", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["latitude", 50.0], ["longitude", 50.0], ["created_at", "2022-01-03 05:41:55.980930"], ["updated_at", "2022-01-03 05:41:55.980930"]]